geot0x1/stm32c071/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "stm32c0xx_hal.h"
#include "stm32c0xx_hal_rcc_ex.h"
#include "tusb.h"
#include <stdio.h>
#include "sys_time.h"
#include "ds18b20.h"
#include "delay.h"
#include "pwm_repeater.h"
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */
typedef struct
{
    uint32_t last_rising_timestamp;
    uint32_t last_falling_timestamp;
    uint32_t last_period;
    uint32_t last_high_time;
    float duty_cycle;
} PwmMeasure;
/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */

/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/

I2C_HandleTypeDef hi2c2;

TIM_HandleTypeDef htim1;
TIM_HandleTypeDef htim2;
TIM_HandleTypeDef htim3;
TIM_HandleTypeDef htim16;
TIM_HandleTypeDef htim17;

PCD_HandleTypeDef hpcd_USB_DRD_FS;

/* USER CODE BEGIN PV */
volatile PwmMeasure capturePB10 = {0};
volatile PwmMeasure capturePB11 = {0};
volatile uint32_t timer3_overflow_count = 0;

static OneWire ow_bus = {
    .port = GPIOB,
    .pin = GPIO_PIN_4
};

static Ds18b20_t ds18b20 = {
    .ow = &ow_bus
};
/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_TIM1_Init(void);
static void MX_USB_PCD_Init(void);
static void MX_TIM2_Init(void);
static void MX_I2C2_Init(void);
static void MX_TIM3_Init(void);
static void MX_FLASH_Init(void);
static void MX_TIM16_Init(void);
static void MX_TIM17_Init(void);
/* USER CODE BEGIN PFP */
uint64_t get_microseconds(void);
/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */

/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{

  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_TIM1_Init();
  MX_USB_PCD_Init();
  MX_TIM2_Init();
  MX_I2C2_Init();
  MX_TIM3_Init();
  MX_FLASH_Init();
  MX_TIM16_Init();
  MX_TIM17_Init();
  /* USER CODE BEGIN 2 */
  
  // Enable USB Clock (adapted from HAL_PCD_MspInit)
  RCC_PeriphCLKInitTypeDef PeriphClkInit = {0};
  PeriphClkInit.PeriphClockSelection = RCC_PERIPHCLK_USB;
  PeriphClkInit.UsbClockSelection = RCC_USBCLKSOURCE_HSE;
  if (HAL_RCCEx_PeriphCLKConfig(&PeriphClkInit) != HAL_OK)
  {
    Error_Handler();
  }
  __HAL_RCC_USB_CLK_ENABLE();
  HAL_Delay(20);
  // Initialize TinyUSB
  tusb_init();

  // Start TIM1 PWM on all Channels
  HAL_TIM_PWM_Start(&htim1, TIM_CHANNEL_1);
  HAL_TIM_PWM_Start(&htim1, TIM_CHANNEL_2);
  HAL_TIM_PWM_Start(&htim1, TIM_CHANNEL_3);
  HAL_TIM_PWM_Start(&htim1, TIM_CHANNEL_4);

  // Start TIM2 PWM on all Channels
  HAL_TIM_PWM_Start(&htim2, TIM_CHANNEL_1);
  HAL_TIM_PWM_Start(&htim2, TIM_CHANNEL_2);

  // Start TIM3 (Free-running timer at 1MHz with interrupts)
  HAL_TIM_Base_Start_IT(&htim3);

  // Initialize Delay (Hardware Timer)
  delay_init();

  // Initialize DS18B20
  ds18b20_begin(&ds18b20);

  // Initialize PWM Repeater
  pwm_repeater_init();

  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  while (1)
  {
    // Non-blocking initialization debug
    tud_task();
    pwm_repeater_tick();
    static uint32_t last_init_debug = 0;
    if (HAL_GetTick() - last_init_debug >= 1000)
    {
      if (tud_cdc_connected())
      {
        char debug_buf[128];
        // sprintf(debug_buf, "TICKS: %lu\r\n", get_ticks());
        // tud_cdc_write_str(debug_buf);
        // tud_cdc_write_flush();
        sprintf(debug_buf, "CH_A: %u Hz, %u\r\n", 
                (unsigned int)pwm_get_frequency_a(), (unsigned int)pwm_get_duty_a());
        tud_cdc_write_str(debug_buf);
        tud_cdc_write_flush();
        sprintf(debug_buf, "CH_B: %u Hz, %u\r\n", 
                (unsigned int)pwm_get_frequency_b(), (unsigned int)pwm_get_duty_b());
        tud_cdc_write_str(debug_buf);
        tud_cdc_write_flush();
      }
      last_init_debug = HAL_GetTick();
    }
    // {
    //     last_init_debug = HAL_GetTick();
    //     if (tud_cdc_connected())
    //     {
    //         ds18b20_begin(&ds18b20); // Perform bus search
    //         uint8_t count = ds18b20_get_sensors_on_bus(&ds18b20);
            
    //         char init_msg[64];
    //         snprintf(init_msg, sizeof(init_msg), "INIT: Sensors=%u\r\n", (unsigned int)count);
    //         tud_cdc_write_str(init_msg);
    //         tud_cdc_write_flush();

    //         if (count > 0)
    //         {
    //             ds18b20_request_temperatures(&ds18b20);
    //             HAL_Delay(1000);
    //             int16_t raw_temp = ds18b20_get_temp(&ds18b20, NULL);
    //             char temp_msg[32];
    //             snprintf(temp_msg, sizeof(temp_msg), "TEMP: %d C\r\n", (int)raw_temp);
    //             tud_cdc_write_str(temp_msg);
    //             tud_cdc_write_flush();
    //             float celsius = ds18b20_raw_to_celsius(raw_temp);
                
    //             // Manual float to integer/fraction formatting
    //             int32_t int_part = (int32_t)celsius;
    //             int32_t frac_part = (int32_t)((celsius - (float)int_part) * 100.0f);
    //             if (frac_part < 0) frac_part = -frac_part;
    //             if (int_part == 0 && celsius < 0)
    //             {
    //                 char temp_msg[32];
    //                 snprintf(temp_msg, sizeof(temp_msg), "TEMP: -%ld.%02ld C\r\n", (long)(-int_part), (long)frac_part);
    //                 tud_cdc_write_str(temp_msg);
    //             }
    //             else
    //             {
    //                 char temp_msg[32];
    //                 snprintf(temp_msg, sizeof(temp_msg), "TEMP: %ld.%02ld C\r\n", (long)int_part, (long)frac_part);
    //                 tud_cdc_write_str(temp_msg);
    //             }
    //             tud_cdc_write_flush();
    //         }
    //     }
    // }
    /* USER CODE END WHILE */

