geot0x1/stm32c071/Core/Src/main.c
    /* USER CODE BEGIN 3 */
     // tinyusb device task
    
    // PWM Repeater Watchdog
    

    // // Periodic PWM Data Reporting
    // static uint32_t last_pwm_print = 0;
    // if (tud_cdc_connected())
    // {
    //     if (HAL_GetTick() - last_pwm_print >= 500)
    //     {
    //         last_pwm_print = HAL_GetTick();
    //         char msg[64];
    //         snprintf(msg, sizeof(msg), "SYSTEM TICK: %lu\r\n", (unsigned long)millis());
            
    //         tud_cdc_write_str(msg);
    //         tud_cdc_write_flush();
    //     }

    //     // Periodic DS18B20 Temperature Reporting (once every 2 seconds)
    //     static uint32_t last_temp_read = 0;
    //     static bool conversion_requested = false;
        
    //     if (!conversion_requested)
    //     {
    //         if (HAL_GetTick() - last_temp_read >= 2000)
    //         {
    //             ds18b20_begin(&ds18b20);
    //             ds18b20_request_temperatures(&ds18b20);
    //             last_temp_read = HAL_GetTick();
    //             conversion_requested = true;
    //         }
    //     }
    //     else
    //     {
    //         // Wait at least 750ms for conversion
    //         if (HAL_GetTick() - last_temp_read >= 800)
    //         {
    //             int16_t raw_temp = ds18b20_get_temp(&ds18b20, NULL);
    //             float celsius = ds18b20_raw_to_celsius(raw_temp);
                
    //             // Manual float to integer/fraction formatting
    //             int32_t int_part = (int32_t)celsius;
    //             int32_t frac_part = (int32_t)((celsius - (float)int_part) * 100.0f);
    //             if (frac_part < 0) frac_part = -frac_part;
    //             if (int_part == 0 && celsius < 0)
    //             {
    //                 // Handle special case where -0.x would lose the negative sign
    //             }
                
    //             char temp_msg[64];
    //             if (celsius < 0 && int_part == 0)
    //             {
    //                 snprintf(temp_msg, sizeof(temp_msg), "TEMP: -0.%02ld C\r\n", (long)frac_part);
    //             }
    //             else
    //             {
    //                 snprintf(temp_msg, sizeof(temp_msg), "TEMP: %ld.%02ld C\r\n", (long)int_part, (long)frac_part);
    //             }
    //             tud_cdc_write_str(temp_msg);
    //             tud_cdc_write_flush();
                
    //             conversion_requested = false;
    //         }
    //     }
        
    //     if (tud_cdc_available())
    //     {
    //         char buf[64];
    //         uint32_t count = tud_cdc_read(buf, sizeof(buf));
    //         tud_cdc_write(buf, count);
    //         tud_cdc_write_flush();
    //     }
    // }

    // Update PWM duty cycle every second
    // static uint32_t last_pwm_update = 0;
    // static uint8_t duty_percent = 0;

    // if (HAL_GetTick() - last_pwm_update >= 1000)
    // {
    //     last_pwm_update = HAL_GetTick();
    //     set_pwm_percentage(&htim1, TIM_CHANNEL_1, duty_percent);

    //     duty_percent += 10;
    //     if (duty_percent > 100)
    //     {
    //         duty_percent = 0;
    //     }
    // }
  }
  /* USER CODE END 3 */
}

/**
  * @brief System Clock Configuration
  * @retval None
  */
void SystemClock_Config(void)
{
  RCC_OscInitTypeDef RCC_OscInitStruct = {0};
  RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

  __HAL_FLASH_SET_LATENCY(FLASH_LATENCY_1);

  /** Initializes the RCC Oscillators according to the specified parameters
  * in the RCC_OscInitTypeDef structure.
  */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE|RCC_OSCILLATORTYPE_HSI48;
  RCC_OscInitStruct.HSEState = RCC_HSE_ON;
  RCC_OscInitStruct.HSI48State = RCC_HSI48_ON;

  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    Error_Handler();
  }

  /** Initializes the CPU, AHB and APB buses clocks
  */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                              |RCC_CLOCKTYPE_PCLK1;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_HSE;
  RCC_ClkInitStruct.SYSCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_HCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_APB1_DIV1;

  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_1) != HAL_OK)
  {
    Error_Handler();
  }
}

/**
  * @brief FLASH Initialization Function
  * @param None
  * @retval None
  */
static void MX_FLASH_Init(void)
{

  /* USER CODE BEGIN FLASH_Init 0 */

  /* USER CODE END FLASH_Init 0 */

  /* USER CODE BEGIN FLASH_Init 1 */

  /* USER CODE END FLASH_Init 1 */
  if (HAL_FLASH_Unlock() != HAL_OK)
  {
    Error_Handler();
  }
  if (HAL_FLASH_Lock() != HAL_OK)
  {
    Error_Handler();
  }
  /* USER CODE BEGIN FLASH_Init 2 */

  /* USER CODE END FLASH_Init 2 */

}

/**
  * @brief I2C2 Initialization Function
  * @param None
  * @retval None
  */
static void MX_I2C2_Init(void)
{

  /* USER CODE BEGIN I2C2_Init 0 */

  /* USER CODE END I2C2_Init 0 */

  /* USER CODE BEGIN I2C2_Init 1 */

  /* USER CODE END I2C2_Init 1 */
  hi2c2.Instance = I2C2;
  hi2c2.Init.Timing = 0x10805D88;
  hi2c2.Init.OwnAddress1 = 0;
  hi2c2.Init.AddressingMode = I2C_ADDRESSINGMODE_7BIT;
  hi2c2.Init.DualAddressMode = I2C_DUALADDRESS_DISABLE;
  hi2c2.Init.OwnAddress2 = 0;
  hi2c2.Init.OwnAddress2Masks = I2C_OA2_NOMASK;
  hi2c2.Init.GeneralCallMode = I2C_GENERALCALL_DISABLE;
  hi2c2.Init.NoStretchMode = I2C_NOSTRETCH_DISABLE;
  if (HAL_I2C_Init(&hi2c2) != HAL_OK)
  {
    Error_Handler();
  }

  /** Configure Analogue filter
  */
  if (HAL_I2CEx_ConfigAnalogFilter(&hi2c2, I2C_ANALOGFILTER_ENABLE) != HAL_OK)
  {
    Error_Handler();
  }

  /** Configure Digital filter
  */
  if (HAL_I2CEx_ConfigDigitalFilter(&hi2c2, 0) != HAL_OK)
  {
    Error_Handler();
  }
  /* USER CODE BEGIN I2C2_Init 2 */

  /* USER CODE END I2C2_Init 2 */

}

/**
  * @brief TIM1 Initialization Function
  * @param None
  * @retval None
  */
static void MX_TIM1_Init(void)
{

  /* USER CODE BEGIN TIM1_Init 0 */

  /* USER CODE END TIM1_Init 0 */

